#составить программу которое запрашивает имя
'''name = input("введите ваше имя: ")
print("Привет,", name )
age = input('Сколько вам лет?' )
print('вам', age, "лет")'''
number = float(input("введите первое число: "))
print("ваше первое число", number )
number2 = float(input("введите второе число: "))
print("ваше второе число", number2)
print("ОПЕРАЦИИ НАД ЧИСЛАМИ")
print("сложение: ", number + number2)
print("вычитание: ", number - number2)
print("умножение: ", number * number2)
print("деление: ", number / number2)
